INSTALLING AND USING PANDAS

In [ ]:
import pandas 
pandas.__version__

In [1]:
import numpy as np
import pandas as pd

series

In [2]:
counts = pd.Series([234,355,456,999])
counts

0    234
1    355
2    456
3    999
dtype: int64

In [3]:
counts.values

array([234, 355, 456, 999], dtype=int64)

In [4]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
bacteria = pd.Series([356,456,567,890],
    index = ['firmicutes', 'proteobacteria','actinobacteria','bacteroidetes'])
bacteria

firmicutes        356
proteobacteria    456
actinobacteria    567
bacteroidetes     890
dtype: int64

In [10]:
np.log(bacteria)

firmicutes        5.874931
proteobacteria    6.122493
actinobacteria    6.340359
bacteroidetes     6.791221
dtype: float64

In [11]:
bacteria[bacteria>500]

actinobacteria    567
bacteroidetes     890
dtype: int64

DATAFRAME

In [32]:
data = {"city": ["bangalore", "chennai", "kerala", "mumbai", "goa"],
        "Year": [2019, 2020, 2018, 2020, 2019],
        "population(cr)": [6.0, 4.5, 3.5, 5.0, 0.5]}
print(data)
print(type(data))
pd.DataFrame(data)

{'city': ['bangalore', 'chennai', 'kerala', 'mumbai', 'goa'], 'Year': [2019, 2020, 2018, 2020, 2019], 'population(cr)': [6.0, 4.5, 3.5, 5.0, 0.5]}
<class 'dict'>

        city  Year  population(cr)
0  bangalore  2019             6.0
1    chennai  2020             4.5
2     kerala  2018             3.5
3     mumbai  2020             5.0
4        goa  2019             0.5

In [35]:
df = pd.DataFrame(data, columns=["city", "Year", "population(cr)"])
df

        city  Year  population(cr)
0  bangalore  2019             6.0
1    chennai  2020             4.5
2     kerala  2018             3.5
3     mumbai  2020             5.0
4        goa  2019             0.5

In [36]:
df['area(sqkm)'] = ['67','99','43','48','89']
df

        city  Year  population(cr) area(sqkm)
0  bangalore  2019             6.0         67
1    chennai  2020             4.5         99
2     kerala  2018             3.5         43
3     mumbai  2020             5.0         48
4        goa  2019             0.5         89

In [40]:
df['serie_aligned'] =pd.Series(range(5),index=[0,1,2,3,4])
df

        city  Year  population(cr) area(sqkm)  serie_aligned
0  bangalore  2019             6.0         67              0
1    chennai  2020             4.5         99              1
2     kerala  2018             3.5         43              2
3     mumbai  2020             5.0         48              3
4        goa  2019             0.5         89              4

In [41]:
df.to_dict()

{'city': {0: 'bangalore', 1: 'chennai', 2: 'kerala', 3: 'mumbai', 4: 'goa'},
 'Year': {0: 2019, 1: 2020, 2: 2018, 3: 2020, 4: 2019},
 'population(cr)': {0: 6.0, 1: 4.5, 2: 3.5, 3: 5.0, 4: 0.5},
 'area(sqkm)': {0: '67', 1: '99', 2: '43', 3: '48', 4: '89'},
 'serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [42]:
pd.DataFrame(df.to_dict())

        city  Year  population(cr) area(sqkm)  serie_aligned
0  bangalore  2019             6.0         67              0
1    chennai  2020             4.5         99              1
2     kerala  2018             3.5         43              2
3     mumbai  2020             5.0         48              3
4        goa  2019             0.5         89              4

In [43]:

data = [{'a':i,'b':10*i} for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [44]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0